darkvolg/BeehiveScale-ESP32/BeehiveScale/BeehiveScale.ino
/*
 * BeehiveScale - Весы пчеловода (ESP8266)
 * Версия определена в Version.h (FW_VERSION).
 */

#include "Version.h"
#include <Wire.h>
#include <LiquidCrystal_I2C.h>
#include <HX711.h>
#include <EEPROM.h>
#if defined(ESP8266)
#include <ESP8266WiFi.h>
#include <ESP8266mDNS.h>
#include <ArduinoOTA.h>
#elif defined(ESP32)
#include <WiFi.h>
#include <ESPmDNS.h>
#include <ArduinoOTA.h>
#include <esp_task_wdt.h>
#include <esp_sleep.h>
#include <driver/rtc_io.h>
#endif

#include "Display.h"
#include "Scale.h"
#include "Button.h"
#include "Memory.h"
#include "RTC_Module.h"
#include "Temperature.h"
#include "Connectivity.h"
#include "SleepManager.h"
#include "WebServerModule.h"
#include "Battery.h"
#include "Alerts.h"      // v5.0.20: Telegram-алерты по батарее/температуре/RTC
#include "MQTTClient.h"  // v5.0.53: MQTT для Home Assistant Discovery
#include "TgPending.h"   // v5.0.58: retry TG при fail
#include "Logger.h"

// Pin mapping — ESP8266 vs ESP32. ESP32 — основная плата с 2026-05-05.
#if defined(ESP32)
  // ESP32-WROOM-32 DevKit V1 (DOIT, 38 пинов)
  // GPIO 6-11 — внутренняя SPI flash (ЗАПРЕЩЕНО).
  // GPIO 0, 2, 12, 15 — boot-strap (осторожно).
  // GPIO 34-39 — input only.
  #define DT_PIN          16   // HX711 DOUT
  #define SCK_PIN         17   // HX711 SCK
  #define BUTTON_PIN      27   // MAIN button (RTC GPIO — можно wake)
  #define MENU_BTN_PIN    26   // MENU button (RTC GPIO)
  // SDA=21, SCL=22 (Wire.begin() default), DS3231 SQW=33, DS18B20=4, Battery ADC=34
#elif defined(ESP8266)
  // HX711 пины. По умолчанию D5/D6 (GPIO14/12) — стандарт ESP8266, как у Bee_Lite v1.1.
  // Для отладочного отката к старой распиновке (D0/TX) — раскомментировать LEGACY_HX711_PINS.
  // 2026-05-04: переход на D5/D6 для Фазы 2 (DEEP_SLEEP) — D0 нужен под перемычку D0→RST.
  // #define LEGACY_HX711_PINS  // OFF: HX711 на D5/D6, D0 свободен под wake-up
  #ifdef LEGACY_HX711_PINS
    #define DT_PIN        16   // D0 — HX711 DOUT (старая распиновка, без pull-up)
    #define SCK_PIN        1   // TX — HX711 SCK (старая распиновка, заблокирует Serial debug)
  #else
    #define DT_PIN        14   // D5 — HX711 DOUT (новая стандартная распиновка)
    #define SCK_PIN       12   // D6 — HX711 SCK
  #endif
  #define BUTTON_PIN       0   // D3 — boot-strap! Не держать при включении
  #define MENU_BTN_PIN     2   // D4 — boot-strap! Не держать при включении
#endif
#define LCD_ADDR      0x27

#define WEIGHT_SAVE_MS    300000UL
#define WEIGHT_SAVE_THR     0.05f
// v5.0.0: тарирование = удержание MAIN ~3 сек (MEDIUM_PRESS), калибровка = ~6 сек (LONG_PRESS).
// Старая логика двойного нажатия с подтверждением убрана.
#define MENU_SCREENS           8
#define STABLE_BUF_SIZE        6
#define STABLE_THR             0.02f
#define STABLE_SAVE_MIN_MS 600000UL  // 10 мин — минимальный интервал между EEPROM-записями при стабилизации
#define SPIKE_FILTER_KG      5.0f    // Отбросить показание если скачок > 5 кг
#define ZERO_DEADBAND_KG     0.05f   // Auto-zero: всё что |вес| < 50г → показываем 0
#define SCALE_READ_INTERVAL_MS  600UL // Период чтения HX711 (v5.0.0: 600мс — быстрый отклик)
#define WDT_TIMEOUT_SEC       30
// AUTO_SLEEP — настраивается через сайт (get_autosleep_sec()), значение в секундах. 0 = не засыпать.

static inline void app_wdt_init() {
#if defined(ESP32)
  #if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
    esp_task_wdt_config_t wdt_cfg = {
      .timeout_ms = WDT_TIMEOUT_SEC * 1000,
      .idle_core_mask = 0,
      .trigger_panic = true
    };
    esp_task_wdt_reconfigure(&wdt_cfg);
    esp_task_wdt_add(NULL);
  #else
    esp_task_wdt_init(WDT_TIMEOUT_SEC, true);
    esp_task_wdt_add(NULL);
  #endif
#elif defined(ESP8266)
  ESP.wdtFeed();
#endif
}

static inline void app_wdt_reset() {
#if defined(ESP32)
  esp_task_wdt_reset();
#elif defined(ESP8266)
  ESP.wdtFeed();
  yield();
#endif
}

LiquidCrystal_I2C lcd(LCD_ADDR, 16, 2);
HX711             scale;

// Serial доступен всю работу: HX711 теперь на D5/D6, UART TX (GPIO1) свободен.

struct SystemState {
  float calibrationFactor = 2280.0f;
  long  offset            = 0;
  float lastSavedWeight   = 0.0f;
  float smoothedWeight    = 0.0f;
  bool  sensorReady       = false;
  bool  emaInitialized    = false;
  TempData tempData;
  float    rtcTempC       = NAN;
  TimeStamp currentTime;
  int  menuScreen         = 0;
  int  lastMenuScreen     = -1;
  bool needsRedraw        = true;
  bool wifiOk             = false;
  float prevWeight        = 0.0f;
  long  prevOffset        = 0;
  bool  hasPrevOffset     = false;  // true после первого тарирования в сессии
  float batVoltage        = 0.0f;
  int   batPercent        = 0;
  String datetimeStr      = "--";
  bool  weightStable      = false;
};

SystemState    sys;
ButtonState    btnMain;
ButtonState    btnMenu;
SleepPersistData persist;
bool webServerStarted = false;
unsigned long lastActivityTime = 0;  // Таймер бездействия для auto-sleep
unsigned long extendSleepUntilMs = 0; // Продление работы по запросу из web (POST /api/keepalive). 0 = неактивно.
bool diagRunRequested = false;       // Флаг запуска диагностики
bool diagDone = false;               // Диагностика завершена (сводка на экране)
bool tgReportPending = false;        // Запрос на отправку TG-отчёта при следующей возможности

void handle_buttons();
void process_weight();
void process_temperature();
void update_interface();
void display_screen_weight();
void display_screen_temp();
void display_screen_diff();
void display_screen_status();
void display_screen_datetime();
void display_screen_battery();
void display_error();
void display_screen_calib_menu();
void display_screen_diag();
void perform_taring();
void undo_tare();
void perform_calibration();
void adjust_calibration();
void show_splash_screen();
void start_webserver();
void check_auto_sleep();

void setup() {
#if defined(ESP32)
  // ═══ v5.0.34 — DS3231 self-latching power-cut (no ESP HOLD pin) ═══
  // Питание ESP контролируется ТОЛЬКО DS3231 SQW open-drain → AO3401 Gate.
  // Когда DS3231 alarm fires → SQW LOW → MOSFET ON → ESP boot.
  // ESP сам себя НЕ держит — DS3231 удерживает SQW LOW пока A1F=1.
  // В sleep_enter() ESP программирует новый alarm и clearAlarm(A1F=0) → SQW HI-Z →
  // 1MΩ pullup тянет Gate к Source → MOSFET OFF → power off.
  //
  // GPIO25 свободен (раньше был HOLD pin). Не используем.

  // v5.0.27 фиксы остаются: CPU 240MHz + освобождение GPIO27 RTC mux
  esp_sleep_wakeup_cause_t wakeCause = esp_sleep_get_wakeup_cause();
  setCpuFrequencyMhz(240);
  if (wakeCause != ESP_SLEEP_WAKEUP_UNDEFINED) {
    rtc_gpio_deinit(GPIO_NUM_27);
    gpio_reset_pin(GPIO_NUM_27);
  }
#endif

