darkvolg/BeehiveScale-ESP32/BeehiveScale/BeehiveScale.ino
  Serial.begin(115200);
  Serial.println(F("\n[" FW_FULLNAME "] boot"));

#if defined(ESP8266)
  ESP.wdtDisable();  // Отключаем программный WDT на время setup (ESP8266 ~3сек по умолчанию)
#endif
  // v5.0.26: WDT инициализируем СРАЗУ после Serial.begin (ДО любых delay).
  app_wdt_init();

#if defined(ESP32)
  // v5.0.27: после DEEPSLEEP_RESET дать ESP-IDF и RF-кальке 500мс на инициализацию.
  if (wakeCause != ESP_SLEEP_WAKEUP_UNDEFINED) {
    Serial.print(F("[Wake] cause=")); Serial.print(wakeCause);
    Serial.print(F(", CPU=")); Serial.print(getCpuFrequencyMhz()); Serial.println(F(" MHz"));
    delay(500);
    esp_task_wdt_reset();
  }
#endif
  pinMode(BUTTON_PIN, INPUT_PULLUP);
  pinMode(MENU_BTN_PIN, INPUT_PULLUP);
  button_attach_interrupt(BUTTON_PIN, btnMain);
  button_attach_interrupt(MENU_BTN_PIN, btnMenu);

#if defined(ESP8266)
  Wire.begin(4, 5);
  Wire.setClock(100000);             // 100 кГц — стабильнее для длинных проводов
  Wire.setClockStretchLimit(2500);   // DS3231 может тянуть до 2ms при конверсии температуры
#else
  Wire.begin();
  // v5.0.8: 400 кГц вместо стандартных 100 кГц. Сокращает время записи на LCD
  // в 4× → каждый I2C-апдейт меньше виден глазом. PCF8574 (LCD-адаптер) и
  // DS3231 поддерживают Fast Mode 400 kHz по даташиту.
  Wire.setClock(400000);
#endif
#if defined(ESP32)
  if (!EEPROM.begin(EEPROM_SIZE)) {
    Serial.println(F("[EEPROM] Init FAILED!"));
  }
#elif defined(ESP8266)
  EEPROM.begin(EEPROM_SIZE);
#endif

  sleep_init();
  sleep_load_persistent(persist);
#ifdef SLEEP_MODE_CONTINUOUS
  persist.wakeupCount++;
  sleep_save_persistent(persist);
#endif

  // v5.0.4: восстанавливаем lastReportWeight из EEPROM (RTC RAM теряется при reset/прошивке).
  // Без этого после каждой перезагрузки первый отчёт шёл без дельты "С прошлого замера".
  {
    float savedReportW = 0.0f;
    if (load_last_report(savedReportW)) {
      persist.lastReportWeight = savedReportW;
      persist.hasLastReport = true;
    }
  }

  // v5.0.5: восстанавливаем lastTempC из EEPROM (fallback для отчётов когда
  // DS18B20 не успел прочитаться к моменту отправки после wake-up).
  {
    float savedTempC = 0.0f;
    if (load_last_temp(savedTempC)) {
      persist.lastTempC = savedTempC;
    }
  }

  lcd_init(lcd);

#ifdef LEGACY_HX711_PINS
  // Старая распиновка использует TX (GPIO1) как HX711 SCK.
  // Закрываем Serial чтобы не было UART-мусора на линии clock.
  Serial.flush();
  Serial.end();
#endif
  scale_init(scale, DT_PIN, SCK_PIN);
  sys.sensorReady = check_sensor(scale);

  bool rtcOk = rtc_init();

#if defined(ESP32)
  // v5.0.35: CRITICAL — после rtc_init() СРАЗУ включить HOLD через Alarm1 PerSecond.
  // SQW pin DS3231 пойдёт LOW → удерживает AO3401 Gate LOW → MOSFET ON.
  // Без этого после отпускания SW2 (или после wake от Alarm2 → ESP очищает A2F)
  // SQW идёт HIGH → MOSFET закрывается → ESP теряет питание.
  // С HOLD ESP может работать спокойно, пока сама не вызовет sleep_enter().
  if (rtcOk) {
    rtc_enable_persecond_hold();
  }
#endif

  if (!temp_init()) {
    Serial.println(F("[Temp] No sensor, readings disabled"));
  }

  load_calibration_data(sys.calibrationFactor, sys.offset, sys.lastSavedWeight);
  sys.prevOffset = load_prev_offset();
  web_settings_init();
  ext_settings_init();
  sched_settings_init();
  tg_report_settings_init();
  tg_settings_init();
  credentials_init();
  // prevWeight при загрузке из EEPROM addr 30 (эталон пользователя).
  // Fallback на lastSavedWeight если EEPROM addr 30 ещё не записан.
  sys.prevWeight = load_prev_weight(sys.lastSavedWeight);

  bat_init();
  alerts_init();   // v5.0.20: загрузить настройки алертов из EEPROM

  if (sys.sensorReady) {
    scale.set_scale(sys.calibrationFactor);
    scale.set_offset(sys.offset);
  }

  yield();
  // v5.0.21: показываем splash и инициализируем датчики ПЕРЕД WiFi,
  // даём 8 сек для стабилизации питания (Boost-преобразователь успевает
  // зарядить капы, банка восстанавливается после пика boot). Только потом
  // включаем WiFi (его пик 300-500мА — главный убийца слабого Boost'а
  // типа MT3608, который защёлкивается по OCP при перегрузке).
  show_splash_screen();
  yield();
  // Показать "Init..." на LCD пока ждём стабилизации
  lcd_clear_buf(lcd);
  lcd_set_cursor(lcd, 0, 0); lcd_print_padded(lcd, "Vesy Pchelovod  ");
  lcd_set_cursor(lcd, 0, 1); lcd_print_padded(lcd, "WiFi cherez 8s..");
  // Делитель ожидания на короткие задержки чтобы watchdog не сработал
  for (int i = 0; i < 80; i++) { delay(100); yield(); app_wdt_reset(); }
  // Теперь WiFi (пик потребления отдельно, после стабилизации питания)
  sys.wifiOk = wifi_init();
  yield();
#if defined(ESP32)
  // v5.0.21: понижаем TX power с 19.5dBm до 11dBm — снижает пик WiFi с ~500мА до ~200мА
  WiFi.setTxPower(WIFI_POWER_11dBm);
  // v5.0.23: setSleep(true) УБРАН — modem-sleep блокировал webserver
  WiFi.setSleep(false);
#endif
  yield();
  if (sys.wifiOk) {
    Serial.println(F("[WiFi] Connected"));
    Serial.print(F("[WiFi] IP: "));
    Serial.println(WiFi.status() == WL_CONNECTED ? WiFi.localIP() : WiFi.softAPIP());
    // v5.0.31: NTP sync ВОЗВРАЩЁН (Core 3.1.3 фиксит баг ESP32 Core 3.0.7).
    // При lost power RTC (после смены ESP32 / отключения CR2032) — без NTP
    // sync alarm power-cut не работает корректно (программирует на invalid time).
    if (get_wifi_mode() == 1 && WiFi.status() == WL_CONNECTED) {
      // Sync только если STA mode + connected. В AP режиме NTP бесполезен.
      if (rtc_lost_power()) {
        Serial.println(F("[NTP] RTC lost power — forcing sync..."));
        ntp_sync_time();
      }
    }
    start_webserver();
    // ArduinoOTA — обновление прошивки по воздуху. Пароль хранится в EEPROM,
    // дефолт "ota_beehive" при пустом блоке credentials (UI показывает warning).
    ArduinoOTA.setHostname("beehivescale");
    {
      char otaPassBuf[32];
      get_ota_pass(otaPassBuf, sizeof(otaPassBuf));
      ArduinoOTA.setPassword(otaPassBuf);
    }
    ArduinoOTA.onStart([]() { lastActivityTime = millis(); });
    ArduinoOTA.onProgress([](unsigned int, unsigned int) { lastActivityTime = millis(); });
    ArduinoOTA.begin();
  } else {
    Serial.println(F("[WiFi] Initialization failed!"));
  }

  log_init();
  lastActivityTime = millis();
#if defined(ESP8266)
  ESP.wdtEnable(8000);  // Включаем программный WDT обратно: 8 сек
#endif

  // Сбросить ISR-флаги кнопок: при boot D3 (GPIO0) и D4 (GPIO2) — boot-strap пины,
  // на них происходят переходные процессы → FALLING-прерывания ловят ложные нажатия.
  // Чистим флаги перед стартом loop, чтобы не было автотарирования при включении.
  noInterrupts();
  btnMain.irqFell = false;
  btnMain.irqTime = 0;
  btnMenu.irqFell = false;
  btnMenu.irqTime = 0;
  interrupts();

  Serial.println(F("[Setup] Done"));
}

void start_webserver() {
  if (webServerStarted) return;

  WebData wd;
  wd.weight          = &sys.smoothedWeight;
  wd.lastSavedWeight = &sys.lastSavedWeight;
  wd.tempC           = &sys.tempData.temperature;
  // humidity поле убрано (пункт 22) — нет физического датчика.
  wd.rtcTempC        = &sys.rtcTempC;
  wd.calibFactor     = &sys.calibrationFactor;
  wd.offset          = &sys.offset;
  wd.sensorReady     = &sys.sensorReady;
  wd.wifiOk          = &sys.wifiOk;
  wd.datetime        = &sys.datetimeStr;
  wd.wakeupCount     = &persist.wakeupCount;
  wd.batVoltage      = &sys.batVoltage;
  wd.batPercent      = &sys.batPercent;
  wd.prevWeight      = &sys.prevWeight;
  wd.lastReportWeight = &persist.lastReportWeight;
  wd.hasLastReport    = &persist.hasLastReport;

  WebActions wa;
  wa.doTare = perform_taring;
  wa.doSave = []() {
    sys.prevWeight = sys.smoothedWeight;
    save_weight(sys.lastSavedWeight, sys.smoothedWeight);
    save_prev_weight(sys.prevWeight);
    // Сохраняем дату фиксации (для UI "зафикс. от ДД.ММ.ГГГГ")
    TimeStamp ts = rtc_now();
    if (ts.valid) {
      DateTime dt(ts.year, ts.month, ts.day, ts.hour, ts.minute, ts.second);
      save_prev_weight_date(dt.unixtime());
    }
  };
  wa.onActivity = []() { lcd_backlight_activity(lcd); };
  wa.doSetCalibFactor = [](float cf) {
    sys.calibrationFactor = cf;
    scale.set_scale(cf);
    save_calibration(cf);
  };
  wa.doSetCalibOffset = [](long ofs) {
    sys.offset = ofs;
    scale.set_offset(ofs);
    save_offset(ofs);
  };

  webserver_init(wd, wa);
  webServerStarted = true;
}

void loop() {
  app_wdt_reset();
  if (sys.wifiOk) {
    ArduinoOTA.handle();
#if defined(ESP8266)
    MDNS.update();
#endif
  }
  static unsigned long lastTempRead   = 0;
  static unsigned long lastTsUpload   = 0;
  static unsigned long lastTgReport   = millis();
  static unsigned long lastBatRead    = 0;
  static unsigned long lastLogWrite   = 0;
  static unsigned long lastSensorChk  = 0;  // фича 14: watchdog HX711
  static int           sensorFailCnt  = 0;
  unsigned long now = millis();

  if (now - lastTempRead >= TEMP_READ_INTERVAL_MS) {
    if (temp_available()) {
      process_temperature();
    }
    sys.currentTime = rtc_now();
    sys.rtcTempC = rtc_temperature();
    // Обновляем datetimeStr сразу после RTC-чтения, чтобы log_append ниже
    // использовал актуальное время (не из прошлой итерации цикла).
    if (sys.currentTime.valid) {
      sys.datetimeStr = rtc_format_datetime(sys.currentTime);
    } else {
      // RTC недоступен — используем uptime как fallback, чтобы запись в лог не блокировалась
      unsigned long sec = millis() / 1000;
      char tb[20];
      snprintf(tb, sizeof(tb), "01.01.2020 %02lu:%02lu:%02lu",
               (sec / 3600) % 24, (sec / 60) % 60, sec % 60);
      sys.datetimeStr = tb;
    }
    lastTempRead = now;
    sys.needsRedraw = true;
  }

  if (now - lastBatRead >= BAT_READ_INTERVAL_MS) {
    sys.batVoltage = bat_voltage();
    sys.batPercent  = bat_percent();
    lastBatRead = now;
    sys.needsRedraw = true;
  }

  handle_buttons();
  process_weight();

