darkvolg/BeehiveScale-ESP32/BeehiveScale/BeehiveScale.ino
  // Auto-return на главный экран (1/8) если 20 сек никто не трогал кнопки.
  // Не применяется на экранах 6 (calib menu) и 7 (diag) — там пользователь работает с интерфейсом.
  static const unsigned long AUTO_HOME_MS = 20000UL;
  if (sys.menuScreen != 0 && sys.menuScreen != 6 && sys.menuScreen != 7
      && (millis() - lastActivityTime) > AUTO_HOME_MS) {
    sys.menuScreen = 0;
    sys.needsRedraw = true;
  }

  update_interface();

  // ── Фича 14: Watchdog HX711 — авто-перезапуск датчика при зависании ──
  if (now - lastSensorChk >= 5000UL) {
    lastSensorChk = now;
    if (!scale.is_ready()) {
      sensorFailCnt++;
      if (sensorFailCnt >= 6) {  // 6 × 5с = 30с без ответа → перезапуск
        Serial.println(F("[HX711] Watchdog: reinit"));
        scale_init(scale, DT_PIN, SCK_PIN);
        sys.sensorReady = check_sensor(scale);
        if (sys.sensorReady) {
          scale.set_scale(sys.calibrationFactor);
          scale.set_offset(sys.offset);
          sys.emaInitialized = false;
          sys.smoothedWeight = 0.0f;
          Serial.println(F("[HX711] Recovered"));
        }
        sensorFailCnt = 0;
      }
    } else {
      sensorFailCnt = 0;
      if (!sys.sensorReady) {
        sys.sensorReady = true;
        sys.needsRedraw = true;
      }
    }
  }

  // В deep sleep режиме лог пишется один раз перед сном (ниже), здесь пропускаем
#ifndef SLEEP_MODE_DEEP_SLEEP
  {
    static uint16_t _lastSchedLogMin = 0xFFFF;
    static bool _bootLogDone = false;
    uint16_t stimes[8]; uint8_t scnt;
    get_sched_times(stimes, scnt);
    bool schedLog = false;
    if (sys.currentTime.valid && scnt > 0) {
      uint16_t cur_min = (uint16_t)sys.currentTime.hour * 60 + sys.currentTime.minute;
      for (uint8_t i = 0; i < scnt; i++) {
        if (stimes[i] == cur_min && _lastSchedLogMin != cur_min) {
          _lastSchedLogMin = cur_min; schedLog = true; break;
        }
      }
    }
    // v5.0.60: если schedLog сработал — пометить _bootLogDone, чтобы bootLog
    // не создал дубликат записи в ту же минуту boot (была баг: 08:00 schedLog +
    // 08:02 bootLog = две записи, первая с temp=0).
    if (schedLog) _bootLogDone = true;

    // Запись при каждом включении (однократно, как только датчик готов)
    bool bootLog = false;
    if (!_bootLogDone && sys.sensorReady && sys.currentTime.valid) {
      _bootLogDone = true;
      if (!schedLog) {  // не дублировать если это уже расписанное время
        bootLog = true;
        // предотвратить повторное срабатывание schedLog в эту же минуту
        if (sys.currentTime.valid)
          _lastSchedLogMin = (uint16_t)sys.currentTime.hour * 60 + sys.currentTime.minute;
      }
    }
    bool useInterval = (scnt == 0);  // интервал только если расписание не задано
    if (schedLog || bootLog || (useInterval && now - lastLogWrite >= LOG_INTERVAL_MS)) {
      // v5.0.60: force temperature read перед log если значение невалидно.
      // schedLog/bootLog могут сработать до того как async process_temperature()
      // успел прочитать DS18B20 → записывалось temp=0.0. Force read даёт корректное.
      if (!sys.tempData.valid && temp_available()) {
        TempData fresh = temp_force_read();
        if (fresh.valid) sys.tempData = fresh;
      }
      log_append(sys.datetimeStr, sys.smoothedWeight,
                 sys.tempData.temperature, sys.tempData.humidity, sys.batVoltage, sys.batPercent);
      // При срабатывании расписания — ставим флаг отправки TG-отчёта.
      // Это решает проблему "ESP спит между расписаниями": каждое запланированное
      // пробуждение в 09:00, 14:00, 21:00 → одна отправка в Telegram с весом и дельтой.
      if (schedLog) tgReportPending = true;
      // v5.0.59: при power-cut архитектуре каждый wake = cold boot (bootLog=true).
      // v5.0.62 FIX: bootLog слать TG ТОЛЬКО если время boot близко (±10 мин) к
      // запланированному слоту. Иначе ручное включение весов (произвольное время,
      // напр. 15:37) тоже слало TG-отчёт — юзер жаловался "при каждом включении приходит".
      // DS3231 scheduled wake: cur≈sched → TG. Ручное включение: далеко → без TG.
      if (bootLog && scnt > 0 && sys.currentTime.valid) {
        uint16_t cur_min = (uint16_t)sys.currentTime.hour * 60 + sys.currentTime.minute;
        for (uint8_t i = 0; i < scnt; i++) {
          int diff = (int)cur_min - (int)stimes[i];
          if (diff < 0) diff = -diff;
          if (diff <= 10) { tgReportPending = true; break; }
        }
      }
      lastLogWrite = now;
      // v5.0.20: проверяем алерты при каждой записи в лог
      // (точно когда есть свежие значения батареи/температуры)
      alerts_check(sys.batVoltage, sys.batPercent,
                   sys.tempData.temperature, sys.currentTime.valid);

      // v5.0.52: детекция роения по резкому падению веса между wake-ми.
      // persist.lastWeight = вес прошлого замера (сохраняется при sleep_save_persistent).
      // Сравниваем только если есть валидный prev и прошло разумное время.
      if (persist.lastWeight > 0.5f && persist.wakeupCount > 0 && sys.currentTime.valid) {
        // Threshold = 3 × alert_delta (общий порог тревоги), мин 1.5 кг.
        float swarmThreshold = web_get_alert_delta() * 3.0f;
        if (swarmThreshold < 1.5f) swarmThreshold = 1.5f;
        // Время с прошлого замера — оценочно через sleep interval.
        uint32_t deltaSec = get_sleep_sec();
        alerts_check_swarm(sys.smoothedWeight, persist.lastWeight, deltaSec, swarmThreshold);
      }

      // v5.0.53: MQTT publish для Home Assistant Discovery.
      // Опубликуется только если MQTT включён в настройках + WiFi connected.
      // v5.0.55: force read temperature если ещё нет валидного значения (после wake
      // async-read может не успеть до log_append). Fallback на persist.lastTempC.
      float mqttTempC = sys.tempData.temperature;
      if (mqttTempC <= -90.0f && temp_available()) {
        TempData fresh = temp_force_read();
        if (fresh.valid) {
          sys.tempData = fresh;
          mqttTempC = fresh.temperature;
        }
      }
      if (mqttTempC <= -90.0f && persist.lastTempC > -90.0f) {
        mqttTempC = persist.lastTempC;  // fallback на старое валидное
      }
      long rssi = (WiFi.status() == WL_CONNECTED) ? WiFi.RSSI() : 0;
      mqtt_publish_data(sys.smoothedWeight,
                        mqttTempC,
                        sys.batVoltage,
                        sys.batPercent,
                        rssi);
    }
  }

  // v5.0.56/57: периодический MQTT publish когда ESP active (вне log_append cycle).
  // Интервал настраивается через UI (default 60 сек, range 10-3600).
  // В sleep mode не вызывается (ESP off).
  static unsigned long lastMqttTick = 0;
  MqttSettings mqttCfg;
  load_mqtt(mqttCfg);
  unsigned long mqttIntervalMs = (unsigned long)mqttCfg.interval * 1000UL;
  if (mqttIntervalMs < 10000UL) mqttIntervalMs = 60000UL;
  if (now - lastMqttTick >= mqttIntervalMs) {
    lastMqttTick = now;
    float liveT = sys.tempData.temperature;
    if (liveT <= -90.0f && persist.lastTempC > -90.0f) liveT = persist.lastTempC;
    long liveRssi = (WiFi.status() == WL_CONNECTED) ? WiFi.RSSI() : 0;
    mqtt_publish_data(sys.smoothedWeight,
                      liveT,
                      sys.batVoltage,
                      sys.batPercent,
                      liveRssi);
  }
#endif

  lcd_backlight_tick(lcd, get_lcd_bl_sec());

  wifi_ensure_connected();
  // Определяем "эффективный" режим WiFi по факту, а не из EEPROM:
  // если STA-подключение упало и wifi_init() сделал fallback на AP, EEPROM остаётся в STA,
  // но реально работаем в AP. Без этой проверки веб-сервер останавливается через 7 сек.
  bool isApMode = (get_wifi_mode() == 0) || (WiFi.getMode() == WIFI_AP);
  if (isApMode) {
    sys.wifiOk = (WiFi.softAPIP() != IPAddress(0,0,0,0));
  } else {
    sys.wifiOk = (WiFi.status() == WL_CONNECTED);
    if (!sys.wifiOk && webServerStarted) {
      // Корректно останавливаем web-сервер перед сбросом флага — иначе при
      // реконнекте повторный _srv.begin() поверх живого слушающего сокета
      // может вести к утечкам / двойным handlers (пункт 7).
      webserver_stop();
      webServerStarted = false;
    }
    // v5.0.23: ntp_loop() ОТКЛЮЧЁН — баг configTime/getLocalTime в ESP32
    // Core 3.0.7 даёт Guru Meditation InstrFetchProhibited.
    // DS3231 RTC даёт точное время самостоятельно. Ручной NTP остаётся
    // через POST /api/ntp если пользователь нажмёт кнопку.
    // ntp_loop();
  }

