darkvolg/BeehiveScale-ESP32/BeehiveScale/BeehiveScale.ino
  if (sys.wifiOk && !webServerStarted) {
    start_webserver();
  }

  if (sys.wifiOk && webServerStarted) {
    webserver_handle();
    static unsigned long lastQueueProc = 0;
    if (now - lastQueueProc >= 60000UL) {
      queue_process();
      lastQueueProc = now;
    }
  }

  if (get_wifi_mode() == 1 && sys.wifiOk) {
    if (now - lastTsUpload >= TS_UPDATE_INTERVAL_MS) {
      float rtcT = rtc_temperature();
      if (!ts_send(sys.smoothedWeight, sys.tempData.temperature,
                   sys.tempData.humidity, rtcT)) {
        queue_add(sys.smoothedWeight, sys.tempData.temperature, 
                  sys.tempData.humidity, rtcT, sys.datetimeStr);
      }
      lastTsUpload = now;
    }

    // v5.0.45: УПРОЩЁННАЯ логика TG отправки.
    //   - Если расписание: tgReportPending=true → TG на каждом scheduled wake
    //   - Если расписания нет: TG шлётся ОДИН РАЗ за wake (cold boot) — каждое
    //     пробуждение из power-cut sleep = новый TG отчёт (юзеру это интуитивно).
    // Старый interval-check (tgRptMs vs millis/unix) удалён — был непонятен.
    // tgRptMs=0 (TG отключён) — single switch для полного выключения TG.
    uint32_t tgRptMs = get_tg_report_interval_min() * 60000UL;
    uint8_t schedCnt = 0; uint16_t schedT[8]; get_sched_times(schedT, schedCnt);
    static bool tgSentSinceBoot = false;
    bool doTgReport = false;
    if (tgReportPending) {
      doTgReport = true;
    } else if (!tgSentSinceBoot && schedCnt == 0 && tgRptMs > 0 && load_tg_on_interval()) {
      // v5.0.48: TG в interval-mode только если galочка "Слать TG при wake без расписания" вкл.
      // Без расписания + tg_on_interval=true → каждый cold-boot wake = TG.
      // Без расписания + tg_on_interval=false → TG не шлётся вообще (тестовый режим).
      doTgReport = true;
    }
    if (doTgReport) {
      TimeStamp ts = rtc_now();
      String dt = rtc_format_datetime(ts);

      // v5.0.5: гарантируем актуальную температуру перед отправкой отчёта.
      // После deep-sleep wake-up DS18B20 часто не успевает прочитаться через async
      // process_temperature() — первое чтение всегда пропускается (power-on 85°C),
      // а отчёт уходит в первые 5-10 сек. Делаем синхронный force-read (~750мс).
      // Если всё равно невалидно — fallback на persist.lastTempC (последняя сохранённая).
      float reportTempC = sys.tempData.temperature;
      if (reportTempC <= -90.0f && temp_available()) {
        TempData fresh = temp_force_read();
        if (fresh.valid) {
          sys.tempData = fresh;
          reportTempC = fresh.temperature;
        }
      }
      if (reportTempC <= -90.0f && persist.lastTempC > -90.0f) {
        reportTempC = persist.lastTempC;  // fallback на старое валидное значение
      }

      // v5.0.62: привес за сутки — только в вечернем (последнем по времени) слоте
      // расписания. Сравниваем с весом вчерашнего вечера (load_evening_weight).
      bool     isEveningSlot = false;
      bool     hasDailyGain  = false;
      float    prevEveningW  = 0.0f;
      uint16_t curDayNum     = 0;
      if (schedCnt > 0 && ts.valid) {
        uint16_t maxSlot = 0;
        for (uint8_t i = 0; i < schedCnt; i++) if (schedT[i] > maxSlot) maxSlot = schedT[i];
        uint16_t cur_min = (uint16_t)ts.hour * 60 + ts.minute;
        int diff = (int)cur_min - (int)maxSlot;
        if (diff < 0) diff = -diff;
        isEveningSlot = (diff <= 15);  // ±15 мин от вечернего слота
        DateTime dtCur(ts.year, ts.month, ts.day, ts.hour, ts.minute, ts.second);
        curDayNum = (uint16_t)(dtCur.unixtime() / 86400UL);
        if (isEveningSlot) {
          float storedW; uint16_t storedDay;
          // показываем привес только если есть запись с ДРУГОГО дня (сутки→сутки)
          if (load_evening_weight(storedW, storedDay) && storedDay != curDayNum) {
            hasDailyGain = true;
            prevEveningW = storedW;
          }
        }
      }

      bool tgOk = tg_send_report(sys.smoothedWeight, reportTempC,
                         sys.tempData.humidity, dt,
                         sys.prevWeight, load_prev_weight_date(),
                         persist.lastReportWeight, persist.hasLastReport,
                         hasDailyGain, prevEveningW);
      if (!tgOk && sys.currentTime.valid) {
        // v5.0.58: TG fail → сохранить для retry при next wake
        DateTime ntp(sys.currentTime.year, sys.currentTime.month, sys.currentTime.day,
                     sys.currentTime.hour, sys.currentTime.minute, sys.currentTime.second);
        int8_t rssi = (WiFi.status() == WL_CONNECTED) ? (int8_t)WiFi.RSSI() : 0;
        tg_pending_save(ntp.unixtime(), sys.smoothedWeight, reportTempC,
                        sys.batVoltage, (uint8_t)sys.batPercent, rssi);
        Serial.println(F("[TG] Send failed — saved for retry at next wake"));
      }
      if (tgOk) {
        tgReportPending = false;
        lastTgReport = now;
        tgSentSinceBoot = true;  // v5.0.45: блокировать повторную отправку в этом wake
        // После успешной отправки: текущий вес становится "вчерашним" для следующего отчёта.
        persist.lastReportWeight = sys.smoothedWeight;
        persist.hasLastReport = true;
        if (reportTempC > -90.0f) persist.lastTempC = reportTempC;
        sleep_save_persistent(persist);
        // v5.0.4: дублируем reportWeight в EEPROM, чтобы дельта не пропадала после reset/прошивки.
        save_last_report(sys.smoothedWeight, true);
        // v5.0.5: то же для температуры — fallback после reset.
        if (reportTempC > -90.0f) save_last_temp(reportTempC);
        // v5.0.62: вечерний слот → сохранить вес как базу для привеса завтра.
        if (isEveningSlot && curDayNum > 0) {
          save_evening_weight(sys.smoothedWeight, curDayNum);
        }
      }
      // если не отправилось (нет WiFi, нет токена) — флаг остаётся, попробуем позже
    }

    // v5.0.58: попытка отправить задержанный TG если он есть (от прошлого fail).
    // Делаем только раз за boot (после успешного WiFi connect).
    static bool tgPendingTried = false;
    if (!tgPendingTried && WiFi.status() == WL_CONNECTED) {
      tgPendingTried = true;
      TgPendingData pd;
      if (tg_pending_load(pd)) {
        Serial.print(F("[TgPending] Found pending TG from unix="));
        Serial.println(pd.unixtime);
        bool ok = tg_send_pending(pd.unixtime, pd.weight, pd.tempC,
                                  pd.batV, pd.batPct, pd.rssi);
        if (ok) {
          tg_pending_clear();
          Serial.println(F("[TgPending] Late report sent OK"));
        } else {
          tg_pending_inc_retry();
          Serial.println(F("[TgPending] Late retry failed"));
        }
      }
    }
  }

  check_auto_sleep();

#ifdef SLEEP_MODE_DEEP_SLEEP
  {
    log_append(sys.datetimeStr, sys.smoothedWeight,
               sys.tempData.temperature, sys.tempData.humidity, sys.batVoltage, sys.batPercent);
  }
  persist.lastWeight = sys.smoothedWeight;
  persist.lastTempC = sys.tempData.temperature;
  // v5.0.29: wakeupCount++ перенесён ВНУТРЬ sleep_enter() (инкремент после wake).
  sleep_save_persistent(persist);
  uint32_t sleepDur = sys.currentTime.valid
    ? sched_next_sec(sys.currentTime.hour, sys.currentTime.minute)
    : get_sleep_sec();
  if (sleepDur < 60) sleepDur = 60;
  Serial.print(F("[Sleep] Sleep for "));
  Serial.print(sleepDur);
  Serial.println(F(" sec"));
  sleep_enter(sleepDur);
  // v5.0.29: Light sleep RETURNS — loop продолжается с этой точки.
  // WiFi уже подключён (modem-sleep сохраняет association). Web/TG готовы.
  lastActivityTime = millis();  // сброс idle-таймера на новый цикл активности
#endif
}

void handle_buttons() {
  // Boot grace period: первые 2 секунды после старта игнорируем кнопки.
  // На ESP8266 это критично из-за boot-strap пинов GPIO0/2; на ESP32 (GPIO27/26 — RTC)
  // таких проблем нет, но небольшой grace всё равно защищает от наводок при инициализации I2C/WiFi.
  if (millis() < 2000UL) {
    // На всякий случай ещё раз чистим ISR-флаги
    noInterrupts();
    btnMain.irqFell = false;
    btnMenu.irqFell = false;
    interrupts();
    return;
  }

  // Wake-press guard: после boot / deep-sleep-wake кнопка часто ещё физически удерживается
  // (пользователь только что её нажал, чтобы разбудить). Если начать считать удержание прямо
  // отсюда, через ~3.5 сек реального удержания сработает MEDIUM_PRESS → выскочит диалог тары
  // сам по себе. Поэтому игнорируем MAIN-кнопку до её первого release. Pressing-цикл начнёт
  // считаться только со следующего, "осознанного" нажатия.
  static bool waitFirstReleaseMain = true;
  if (waitFirstReleaseMain) {
    if (digitalRead(BUTTON_PIN) == HIGH) {
      waitFirstReleaseMain = false;
      noInterrupts();
      btnMain.irqFell = false;
      interrupts();
      btnMain.lastRaw = false;
      btnMain.isPressed = false;
      btnMain.longFired = false;
    } else {
      // Кнопка ещё держится с момента wake — поддерживаем подсветку и выходим.
      lastActivityTime = millis();
      lcd_backlight_activity(lcd);
      return;
    }
  }

