darkvolg/BeehiveScale-ESP32/BeehiveScale/BeehiveScale.ino
  // v5.0.3: раздельные пороги по кнопкам.
  // MAIN: тара 3.0 сек, калибровка 6.0 сек. MENU: на 1/8 за 2.5 сек, без MEDIUM.
  ButtonAction actMain = read_button(BUTTON_PIN,    btnMain, 3000UL, 6000UL);
  ButtonAction actMenu = read_button(MENU_BTN_PIN,  btnMenu,    0UL, 2500UL);

  // Подсветка: реагировать на физическое нажатие сразу, не ждать debounce/release
  bool anyPressed = (digitalRead(BUTTON_PIN) == LOW || digitalRead(MENU_BTN_PIN) == LOW);
  if (anyPressed || actMain != NO_ACTION || actMenu != NO_ACTION) {
    lastActivityTime = millis();
    lcd_backlight_activity(lcd);
  }

  // Визуальная подсказка во время удержания MAIN — пользователь сразу видит, когда отпускать.
  // Показываем только на главных экранах (не 6/7, там SHORT работает иначе).
  static int mainHintLevel = 0;
  if (sys.menuScreen != 6 && sys.menuScreen != 7) {
    unsigned long mainHeld = button_hold_ms(btnMain);
    int level = 0;
    if (mainHeld >= 6000UL) level = 2;
    else if (mainHeld >= 3000UL) level = 1;
    if (level != mainHintLevel) {
      if (level == 1) {
        lcd_set_cursor(lcd,0, 1); lcd_print_padded(lcd, "Otpust = TARA!  ");
      } else if (level == 2) {
        lcd_set_cursor(lcd,0, 1); lcd_print_padded(lcd, "Otpust = KALIBR ");
      }
      // level == 0 (release) — обработчики MEDIUM/LONG ниже сами перерисуют LCD.
      mainHintLevel = level;
    }
  }

  // Логика MAIN-кнопки (v5.0.2 — возврат к v5.0.0 схеме):
  //   SHORT (быстрое нажатие, < 3.5 сек)         — на экранах 6/7 спец-режимы; иначе ничего
  //                                                 (просто будит экран / лечит подсветку,
  //                                                  случайных тарирований больше нет)
  //   MEDIUM (отпустил после ≥ 3.5 сек, < 6.5 c) — запрос подтверждения "Tara? MENU=OK".
  //                                                 Тара выполняется при нажатии MENU SHORT
  //                                                 в окне 4 сек, иначе — отмена.
  //   LONG (≥ 6.5 сек удержания, auto-fire)      — старт калибровочного мастера.
  static bool tareConfirmPending = false;
  static unsigned long tareConfirmStartMs = 0;

  if (actMain == SHORT_PRESS) {
    if (sys.menuScreen == 6) {
      adjust_calibration();
      sys.needsRedraw = true;
    } else if (sys.menuScreen == 7) {
      diagRunRequested = true;
      sys.needsRedraw = true;
    }
    // На остальных экранах MAIN SHORT — ничего: просто разбудили дисплей.
  }

  if (actMain == MEDIUM_PRESS && sys.menuScreen != 6 && sys.menuScreen != 7) {
    tareConfirmPending = true;
    tareConfirmStartMs = millis();
    lcd_clear_buf(lcd);
    lcd_set_cursor(lcd,0, 0); lcd_print_padded(lcd, "Tara? MENU=OK   ");
    lcd_set_cursor(lcd,0, 1); lcd_print_padded(lcd, "Otmena cherez 4s");
  }

  if (actMain == LONG_PRESS && sys.menuScreen != 6 && sys.menuScreen != 7) {
    tareConfirmPending = false;
    perform_calibration();
    sys.needsRedraw = true;
  }

  // Перехватываем MENU SHORT в режиме подтверждения тары — иначе он бы переключил меню.
  if (tareConfirmPending && actMenu == SHORT_PRESS) {
    tareConfirmPending = false;
    perform_taring();
    sys.needsRedraw = true;
    return;
  }

  // Таймаут окна подтверждения (4 сек) — тихая отмена с сообщением.
  if (tareConfirmPending && (millis() - tareConfirmStartMs > 4000UL)) {
    tareConfirmPending = false;
    lcd_clear_buf(lcd);
    lcd_set_cursor(lcd,0, 0); lcd_print_padded(lcd, "Tara: otmena    ");
    lcd_set_cursor(lcd,0, 1); lcd_print_padded(lcd, "                ");
    { unsigned long _t=millis(); while(millis()-_t<800UL){app_wdt_reset();yield();} }
    sys.needsRedraw = true;
  }
  static int menuPressCount = 0;
  static unsigned long lastMenuPressTime = 0;

  if (actMenu == SHORT_PRESS) {
    menuPressCount++;
    if (menuPressCount == 1) {
      lastMenuPressTime = millis();
    } else if (millis() - lastMenuPressTime < 500UL) {
      if (sys.hasPrevOffset) {
        undo_tare();
      } else {
        // Нет предыдущей тары — двойное нажатие = просто ещё один шаг меню
        sys.menuScreen = (sys.menuScreen + 1) % MENU_SCREENS;
        sys.needsRedraw = true;
      }
      menuPressCount = 0;
      return;
    } else {
      // Второе нажатие, но окно 500мс истекло (loop блокировался process_weight)
      // Прокручиваем меню за первое нажатие, текущее становится новым первым
      sys.menuScreen = (sys.menuScreen + 1) % MENU_SCREENS;
      sys.needsRedraw = true;
      menuPressCount = 1;
      lastMenuPressTime = millis();
    }
  }
  if (menuPressCount == 1 && millis() - lastMenuPressTime >= 500UL) {
    sys.menuScreen = (sys.menuScreen + 1) % MENU_SCREENS;
    sys.needsRedraw = true;
    menuPressCount = 0;
  }
  if (actMenu == LONG_PRESS) {
    sys.menuScreen = 0;
    menuPressCount = 0;
    sys.needsRedraw = true;
  }
}

void process_weight() {
  static unsigned long lastSaveTime         = 0;
  static unsigned long lastStableSaveTime   = 0;
  static unsigned long lastReadTime         = 0;
  static unsigned long lastPrevWeightSave   = 0;
  static float         lastSavedPrevWeight  = NAN;
  static float stableBuf[STABLE_BUF_SIZE];
  static int   stableBufIdx = 0;
  static int   stableBufCnt = 0;
  static bool  stableSaved  = false;

  // Период чтения HX711. 1500мс — компромисс между скоростью отклика UI
  // и нагрузкой на CPU/WebServer. HX711@10Hz даёт независимые сэмплы каждые 100мс.
  if (millis() - lastReadTime < SCALE_READ_INTERVAL_MS) return;

  // v5.0.6: пропускаем чтение HX711 если пользователь сейчас держит кнопку.
  // wait_ready_timeout(1000)+get_units() блокирует loop до 1.5 сек — за это время
  // теряются нажатия и сбивается отсчёт удержания. Откладываем чтение до отпускания.
  if (digitalRead(BUTTON_PIN) == LOW || digitalRead(MENU_BTN_PIN) == LOW) {
    return;
  }
  lastReadTime = millis();

  // spikeRejectCnt перенесён наверх функции чтобы его можно было сбросить
  // при раннем return по NaN (пункт 17). Ранее был static в середине ниже
  // по коду — это приводило к накоплению счётчика при серии NaN и возможному
  // случайному срабатыванию 5-rejection reset при первом валидном чтении.
  static int spikeRejectCnt = 0;

  float raw = scale_read_weight(scale, SCALE_READ_SAMPLES);
  if (isnan(raw)) {
    spikeRejectCnt = 0;
    if (sys.sensorReady) {
      sys.sensorReady = false;
      sys.needsRedraw = true;
    }
    return;
  }

